nodejs/lib/finditems.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns="http://www.ebay.com/marketplace/search/v1/services">
   <soapenv:Header/>
   <soapenv:Body>
      <findItemsRequest>
         <context>
            <currency>USD</currency>
        <globalId>EBAY-US</globalId>
         </context>
         <fetchSize>50</fetchSize>
         <fetchOffset>0</fetchOffset>
    <readSet>
            <member>
               <namespace>ItemDictionary</namespace>
               <name>ITEM_ID</name>
            </member>
         </readSet>
         <readSet>
            <member>
               <namespace>ItemDictionary</namespace>
               <name>TITLE</name>
            </member>
         </readSet>
         <readSet>
            <member>
               <namespace>ItemDictionary</namespace>
               <name>CURRENT_PRICE</name>
            </member>
         </readSet>
         <readSet>
              <expression>
                 <member>
                    <namespace>ItemDictionary</namespace>
                    <name>ITEM_FORMAT</name>
                 </member>
                 <operator>
                    <simpleLogicalOperator>EQ</simpleLogicalOperator>
                 </operator>
                 <operand>
                    <stringValue>AUCTION</stringValue>
                 </operand>
                 <type>SimpleLogicalExpression</type>
              </expression>
        </readSet>
        <readSet>
            <expression>
               <member>
                  <namespace>ItemDictionary</namespace>
                  <name>ITEM_FORMAT</name>
               </member>
               <operator>
                  <simpleLogicalOperator>EQ</simpleLogicalOperator>
               </operator>
               <operand>
                  <stringValue>BIN</stringValue>
               </operand>
               <type>SimpleLogicalExpression</type>
            </expression>
        </readSet>
        <readSet>
            <member>
               <namespace>Attribute</namespace>
               <name>4088</name>
            </member>
         </readSet>
         <readSet>
            <member>
               <namespace>ItemDictionary</namespace>
               <name>EFFECTIVESTARTTIME</name>
            </member>
         </readSet>
         <readSet>
            <member>
               <namespace>ItemDictionary</namespace>
               <name>FITMENT</name>
               <property>
                  <name>BY_APPLICATION</name>
                  <value>true</value>
               </property>
               <property>
                  <name>BY_SPECIFICATION</name>
                  <value>true</value>
               </property>
            </member>
         </readSet>
         
         <constraint>
            <expression>
               <member>
                  <namespace>ItemDictionary</namespace>
                  <name>SAFE_START_TIME</name>
               </member>
               <operator>
                  <simpleLogicalOperator>LEQ</simpleLogicalOperator>
               </operator>
               <operand>
                  <stringValue>NOW</stringValue>
               </operand>
               <type>SimpleLogicalExpression</type>
            </expression>
         </constraint>
         <constraint>
            <expression>
               <member>
                  <namespace>ItemDictionary</namespace>
                  <name>SHOW_IN_SITE</name>
                  <property>
                     <name>SiteId</name>
                     <value>0</value>
                  </property>
                  <property>
                     <name>InventoryType</name>
                     <value>INCLUDE_SIF</value>
                  </property>
               </member>
               <type>StrategyLogicalExpression</type>
            </expression>
         </constraint>
         <constraint>
            <expression>
               <member>
                  <namespace>ItemDictionary</namespace>
                  <name>END_TIME</name>
               </member>
               <operator>
                  <simpleLogicalOperator>GEQ</simpleLogicalOperator>
               </operator>
               <operand>
                  <fieldValue>
                     <expression>
                        <operator>
                           <simpleNumericOperator>ADD</simpleNumericOperator>
                        </operator>
                        <operand>
                           <stringValue>NOW</stringValue>
                        </operand>
                        <operand>
                           <longValue>10</longValue>
                        </operand>
                        <type>SimpleNumericExpression</type>
                     </expression>
                  </fieldValue>
               </operand>
               <type>SimpleLogicalExpression</type>
            </expression>
         </constraint>
         <constraint>
            <expression>
               <operator>
                  <keywordLogicalOperator>CONTAINS</keywordLogicalOperator>
               </operator>
               <operand>
                  <stringValue>ipod</stringValue>
               </operand>
               <type>KeywordLogicalExpression</type>
            </expression>
         </constraint>
         <constraint>
            <expression>
               <member>
                  <namespace>ItemDictionary</namespace>
                  <name>MSKU_VIEW</name>
               </member>
               <operator>
                  <simpleLogicalOperator>EQ</simpleLogicalOperator>
               </operator>
               <operand>
                  <stringValue>VARIANT_ONLY</stringValue>
               </operand>
               <type>SimpleLogicalExpression</type>
            </expression>
         </constraint>
         <constraint>
            <expression>
               <member>
                  <namespace>ItemDictionary</namespace>
                  <name>ALL_CATS</name>
               </member>
               <operator>
                  <simpleLogicalOperator>EQ</simpleLogicalOperator>
               </operator>
               <operand>
                  <longValue>0</longValue>
               </operand>
               <type>SimpleLogicalExpression</type>
            </expression>
         </constraint>
         <sort>
            <bestMatch>
            </bestMatch>
         </sort>
      </findItemsRequest>
   </soapenv:Body>
</soapenv:Envelope>